In [2]:
import pandas as pd
from sqlalchemy import create_engine

### Store CSV into DataFrame

In [27]:
#Read file data
csv_file = "Data/zipcode_medians_combined.csv"
data_df = pd.read_csv(csv_file)
data_df.head()

,Unnamed: 0,zip,Median Price 2008,Median Price/sqft 2008,Median sqft 2008,Sales 2008,Community,Sales 2018,Median Price 2017,Median Price 2018
0,0,95603,285000.0,207.0,1255.0,3,Auburn,29,407550,440000
1,1,95608,248567.0,182.0,1472.0,20,Carmichael,61,372250,399500
2,2,95610,219000.0,123.0,1410.0,7,Citrus Heights,29,325000,362000
3,3,95621,168646.0,143.0,1268.0,28,Citrus Heights,32,306000,316500
4,4,95624,229000.0,139.0,1721.0,31,Elk Grove,74,390000,424000

### Create new data with select columns

In [29]:
new__data_df = data_df[['zip', 'Median Price 2008', 'Sales 2008', 'Median Price 2018', 'Sales 2018']].copy()
new__data_df.head()

     zip  Median Price 2008  Sales 2008  Median Price 2018  Sales 2018
0  95603           285000.0           3             440000          29
1  95608           248567.0          20             399500          61
2  95610           219000.0           7             362000          29
3  95621           168646.0          28             316500          32
4  95624           229000.0          31             424000          74

### Connect to local database

In [6]:
rds_connection_string = "<cphyland>:<insert password>@localhost:5432/customer_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

### Check for tables

In [7]:
engine.table_names()

['customer_location', 'customer_name']

### Use pandas to load csv converted DataFrame into database

In [8]:
new_customer_data_df.to_sql(name='customer_name', con=engine, if_exists='append', index=False)

### Use pandas to load json converted DataFrame into database

In [9]:
new_customer_location_df.to_sql(name='customer_location', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the customer_name table
* NOTE: can also check using pgAdmin

In [10]:
pd.read_sql_query('select * from customer_name', con=engine).head()

   id first_name last_name
0   1    Benetta   Cancott
1   2     Lilyan    Cherry
2   3    Ezekiel   Benasik
3   4    Kennedy     Atlay
4   5    Sanford    Salmen

### Confirm data has been added by querying the customer_location table

In [11]:
pd.read_sql_query('select * from customer_location', con=engine).head()

   id                address  us_state
0   1  043 Mockingbird Place   Indiana
1   2       4 Prentice Point   Indiana
2   3      46 Derek Junction     Texas
3   4  11966 Old Shore Place  Missouri
4   5     5 Evergreen Circle  New York